# SetBeamAngle

## Description
Procedure SetBeamAngle sets the spread angle of the referenced spot light.&lt;BR&gt;

```pascal
PROCEDURE SetBeamAngle(
				h          : HANDLE;
				beamAngleR : REAL);
```

```python

def vs.SetBeamAngle(h, beamAngleR):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to light.|
|beamAngleR|REAL|Beam angle of light.|

## Version
Availability: from MiniCAD7.0
## Category
* Objects - Lights